In [1]:
import pandas as pd

print(pd.__version__)

2.3.3

In [5]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0 -0.094352  0.159518       NaN -0.524023
1      1 -0.000931       NaN  0.347937 -1.568683
2      2 -1.545294 -1.223283 -0.066250 -0.394832
3      3 -1.541985 -2.108218 -2.043901 -1.529649
4      4 -2.309095       NaN  2.506108  0.258946

In [6]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0 -0.094352  0.159518       NaN -0.524023
1  1 -0.000931       NaN  0.347937 -1.568683
2  2 -1.545294 -1.223283 -0.066250 -0.394832
3  3 -1.541985 -2.108218 -2.043901 -1.529649
4  4 -2.309095       NaN  2.506108  0.258946

In [10]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

     Z         A         B         C         D
2    2 -1.545294 -1.223283 -0.066250 -0.394832
3    3 -1.541985 -2.108218 -2.043901 -1.529649
8    8 -1.185182 -0.631247  0.040514  0.664402
9    9  0.320749  0.181706 -0.518968  1.063813
12  12 -1.593559 -0.318737  1.310066  0.250149

In [11]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.133333
B    0.233333
C    0.166667
D    0.100000
dtype: float64

In [3]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   D
0  1
1  2
2  3
3  4